In [1]:
import pandas as pd

In [2]:
# Series 序列，用来存储任意类型一维数组，包含数值和索引，默认索引0，1，2，3...
s = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'd'])

In [3]:
s

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
# DataFrame 二维数据表格
# 可以通过列表、字典、二维数组创建

# 1.列表创建
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
# 定义列索引和行索引
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], 
                  columns=["fir","sec","thir"],
                  index = ["一","二","三"])
print(df)

   fir  sec  thir
一    1    2     3
二    4    5     6
三    7    8     9

In [6]:
# 通过字典创建
dic = {'姓名':["Alan","Bob","Chole"],
       '性别':["female","male","male"]}
df = pd.DataFrame(dic, index = ["一","二","三"])
print(df)

      姓名      性别
一   Alan  female
二    Bob    male
三  Chole    male

In [7]:
# 二维数组创建DataFrame
import numpy as np

arr = np.arange(12).reshape(3,4)
df = pd.DataFrame(arr)
print(df)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

### 文件读取和写入

**读取excel、csv、txt**     
pd.read_excel()  
pd.read_csv()  
pd.read_table()    
**写入excel、csv、txt**  
df.to_excel("", index = False)  # index = False可以去除索引写入。  
df.to_csv("", sep = '\t', index = False) # sep可以自定义分割符，默认","。  
df.to_csv()也可以写入txt

In [51]:
titanic = pd.read_csv("tatanic.csv")
titanic.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [10]:
titanic.to_excel("titanic.xlsx", sheet_name = "Passengers", index = False)

In [11]:
titanic = pd.read_excel("titanic.xlsx", sheet_name="Passengers")

In [13]:
ages = titanic['Age']
PassengerId = titanic["PassengerId"]
Name = titanic["Name"]

Name[290]

'Barber, Miss. Ellen "Nellie"'

In [14]:
# 筛选多列，注意多个列名放到列表里面，内层列表用来包含筛选列，外层列表用来进行筛选操作
age_sex_id = titanic[['PassengerId','Age','Sex']]
age_sex_id.head()

   PassengerId   Age     Sex
0            1  22.0    male
1            2  38.0  female
2            3  26.0  female
3            4  35.0  female
4            5  35.0    male

In [15]:
age_sex_id.shape

(891, 3)

<p style="text-align:center">Series 类型和 DataFrame类型的选择器区别，和返回值区别:</p>

|**Object Type**|**Selection** | **Return Value Type**|
|-----------: |-----: |-----------------: |
|Series      |<p style="color:red">Series[label] </p> |scalar value|
|DataFrame   |<p style="color:red">frame[colname]  |Series <br>corresponding<br> to colname|

In [16]:
type(age_sex_id)

pandas.core.frame.DataFrame

In [23]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [50]:
# 条件筛选
above_35 = titanic[titanic['Age'] > 3]

In [49]:
# Passengers from cabin class 2 or 3
# 筛选列里面的特定值，比较运算符是筛选范围值
class_23 = titanic[titanic["Pclass"].isin(["3","1"])]
class_23_ = titanic[(titanic["Pclass"] == 2) | (titanic["Pclass"] == 3)]
# 上述两个DF是一样的

In [53]:
# 去除空值，notna()函数，筛选非空值
age_not_null = titanic[titanic['Age'].notna()]

In [54]:
# how do i select specific rows and columns 
# 如何筛选行和列？使用loc/iloc，逗号前为行，后为列
adult_names = titanic.loc[titanic['Age'] > 35, "Name"]
adult_names.head()

1     Cumings, Mrs. John Bradley (Florence Briggs Th...
6                               McCarthy, Mr. Timothy J
11                             Bonnell, Miss. Elizabeth
13                          Andersson, Mr. Anders Johan
15                     Hewlett, Mrs. (Mary D Kingcome)
Name: Name, dtype: object

---------------------------
在需要同时筛选行和列时，需要用到loc/iloc方法，loc/iloc[行, 列]，iloc一般传入数字当作筛选索引，loc传入具体的index字符

In [ ]:
# 选取指定范围内dataframe子集
# 比如选取10-13行，3-5列
titanic.iloc[9:13, 2:5]

> **REMEMBER 总结**    
> * 选取DF子集，需要用到中括号[]。
> * Inside these brackets, you can use a single column/row label, a list of column/row labels, a slice of labels, a conditional expression or a colon.
中括号里面可以使用单行或单列标签索引，多行多列索引需要用中括号列表形式传入，也可以使用切片索引或者条件运算表达式。
> * Select specific rows and/or columns using loc when using the row and column names 以行和列的名字作为索引来选取特定的行和列时，需要使用loc方法
> * Select specific rows and/or columns using iloc when using the positions in the table 以行和列的序号索引来选取特定区域时，需要使用iloc方法
> * You can assign new values to a selection based on loc/iloc.
使用loc/iloc在选取特定区域时，可以直接赋新值覆盖此区域内容

> 【matplotlib绘图相关】：https://pandas.pydata.org/docs/getting_started/intro_tutorials/04_plotting.html

# 插入新列：

In [70]:
air_quality = pd.read_csv("air.csv", index_col=0, parse_dates=True)

In [71]:
air_quality.head()

                     station_antwerp  station_paris  station_london
datetime
2019-05-07 02:00:00              NaN            NaN            23.0
2019-05-07 03:00:00             50.5           25.0            19.0
2019-05-07 04:00:00             45.0           27.7            19.0
2019-05-07 05:00:00              NaN           50.4            16.0
2019-05-07 06:00:00              NaN           61.9             NaN

In [72]:
# 插入一列，用以显示London的NO2浓度
# 25摄氏度标准大气压下，换算系数为1.882
air_quality["london_mg/m^3"] = air_quality["station_london"] * 1.882
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg/m^3
datetime,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,43.286
2019-05-07 03:00:00,50.5,25.0,19.0,35.758
2019-05-07 04:00:00,45.0,27.7,19.0,35.758
2019-05-07 05:00:00,NaN,50.4,16.0,30.112
2019-05-07 06:00:00,NaN,61.9,NaN,NaN

In [74]:
air_quality["test"] = [i for i in range(len(air_quality["station_antwerp"]))]

In [76]:
air_quality["paris/antwerp"] = air_quality["station_paris"] / air_quality["station_antwerp"]

In [77]:
air_quality.head()

,station_antwerp,station_paris,station_london,london_mg/m^3,test,paris/antwerp
datetime,,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,43.286,0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,35.758,1,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,35.758,2,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,30.112,3,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,4,NaN

In [79]:
# 列字段重命名
air_quality_rename = air_quality.rename(
    columns = {
        "station_antwerp": "BETR801",
        "station_london": "London Westminster",
        "station_paris": "FR04014"
    }
)

In [80]:
air_quality_rename.head()

,BETR801,FR04014,London Westminster,london_mg/m^3,test,paris/antwerp
datetime,,,,,,
2019-05-07 02:00:00,NaN,NaN,23.0,43.286,0,NaN
2019-05-07 03:00:00,50.5,25.0,19.0,35.758,1,0.495050
2019-05-07 04:00:00,45.0,27.7,19.0,35.758,2,0.615556
2019-05-07 05:00:00,NaN,50.4,16.0,30.112,3,NaN
2019-05-07 06:00:00,NaN,61.9,NaN,NaN,4,NaN

In [93]:
# 关于DataFrame的增删改查
df = pd.DataFrame()
df["one"] = [1,2,3]
df

   one
0    1
1    2
2    3

In [94]:
# 增
df["two"] = df["one"] + 10
df["three"] = df["one"] ** 2
df["flag"] = df["one"] > 2

In [95]:
df

   one  two  three   flag
0    1   11      1  False
1    2   12      4  False
2    3   13      9   True

In [96]:
# 删
del df["one"]
df

   two  three   flag
0   11      1  False
1   12      4  False
2   13      9   True

In [97]:
# 弹出删
two = df.pop("two")
df

   three   flag
0      1  False
1      4  False
2      9   True

In [99]:
# 插入指定位置列
df.insert(0, "first_col", df["flag"])
df

   first_col  three   flag
0      False      1  False
1      False      4  False
2       True      9   True

In [119]:
# 聚合函数
# max() min() median() mean() describe()
titanic[["Age", "Fare"]].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [120]:
# 分组
titanic[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  27.915709
male    30.726645

In [123]:
titanic.groupby("Sex").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [124]:
# 按性别分组，年龄平均值
titanic.groupby("Sex")["Age"].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

![image.png]("../../.all_images/11234.png")